Autodesk.Revit.UI.Events.DialogBoxData.OverrideResult(System.Int32)
Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
result:  The result code you wish the Revit dialog to return.
Returns:  Returns true if the result code was accepted.

Autodesk.Revit.UI.Events.DialogBoxData.HelpId
An ID that represents the dialog that has been displayed.
Remarks:  Use this ID within your application to key suitable responses for the dialog. Note: this id is
not guaranteed to remain stable for different builds of Autodesk Revit.

Autodesk.Revit.UI.Events.DialogBoxData
An object that is passed to your application when a dialog is displayed in Revit.
Remarks:
When the application receives this object, a dialog has been displayed in Revit that
requires user interaction. The OverrideResult function can be used to cause the dialog
to be dismissed and return a desired result code.